
## :white_check_mark: Apply Succeeded (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8670682381)



<pre><code>Apply complete! Resources: 1 added, 1 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
google_storage_bucket.public_image_bucket: Refreshing state... [id=lgtm-public-image-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_storage_bucket.public_image_bucket will be updated in-place
  ~ resource "google_storage_bucket" "public_image_bucket" {
        id                          = "lgtm-public-image-bucket"
        name                        = "lgtm-public-image-bucket"
      ~ uniform_bucket_level_access = true -> false
        # (13 unchanged attributes hidden)

      ~ cors {
          ~ origin          = [
              + null,
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # google_storage_bucket_access_control.public_image_bucket will be created
  + resource "google_storage_bucket_access_control" "public_image_bucket" {
      + bucket = "lgtm-public-image-bucket"
      + domain = (known after apply)
      + email  = (known after apply)
      + entity = "allUsers"
      + id     = (known after apply)
      + role   = "READER"
    }

Plan: 1 to add, 1 to change, 0 to destroy.
google_storage_bucket.public_image_bucket: Modifying... [id=lgtm-public-image-bucket]
google_storage_bucket.public_image_bucket: Modifications complete after 1s [id=lgtm-public-image-bucket]
google_storage_bucket_access_control.public_image_bucket: Creating...
google_storage_bucket_access_control.public_image_bucket: Creation complete after 1s [id=lgtm-public-image-bucket/allUsers]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terraform-apply","PRNumber":4,"Program":"tfcmt","SHA1":"fcef837054b50b02257cf3ecb32e56a51f8bf194","Target":"dev","Vars":{},"WorkflowName":"Run Terragrunt Apply on main branch push"} -->